{
  "location":"Osaka",
  "date":"20190617",
  "id":"20190617",
  "place":"Osaka",
  "imgsrc":"/assets/images/20190617-shinsaibashisuji.jpeg",
  "english":"Osaka",
  "japanese":"大阪",
  "content":[
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"Today I left SFO and arrived at Kansai International Airport, which is located in Osaka-fu (the prefecture which contains Osaka city). The plane ride was a long 11 hours, but other than getting bored and my butt hurting from sitting so long the flight was alright. After landing I boarded the 関西快速 (I think that's Kansai airport rapid in English) and made my way to Imamiya-eki to get inside of Osaka city, and then hopped on the subway at that station to get to Nanba station, which is a 5 minute walk from my hotel at Redroof! My hotel, if you read the info page, is right near the super duper touristy Dotonbori shopping street. This place is known for its street food, especially its takoyaki (an Osaka specialty). I made takoyaki my first purchase here."
    },
    {
      "tag":"images",
      "id":"takoyaki-pic",
      "class":"",
      "style":{},
      "content":[
        {
          "src":"/assets/images/20190617-kukuru.jpeg",
          "style":{
            "height":"40vh",
            "minWidth":"100%"
          },
          "english":"Kukuru",
          "japanese":"くくる"
        },
        {
          "src":"/assets/images/20190617-takoyaki.jpeg",
          "style":{
            "height":"50vh",
            "minWidth":"100%"
          },
          "english":"Takoyaki",
          "japanese":"たこ焼き"
        }
      ]
    },
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"After eating that I walked around a bit more, and then went back to my hotel. I've been up for about 20 hours now, creeping on 21, so probably about time I crashed. I took some not-so-great pictures of the streets (I still don't know how to use a real camera). Something that gave me a laugh was when I bought this food from a family mart (one of the three major conbini chains) I said thanks to the cashier in Japanese and when I looked back they had a really surprised face, so I'm not sure if it's just that I said thanks without stuttering in Japanese and they were surprised about that or just something else entirely, but I like to think I wowed them by just knowing how to say please and thanks (but it was probably something else). I also messed up opening my onigiri because I forgot they have an origami like wrapping that is meant for you to pull at the edges to open it, so that the seaweed properly wraps the rice. The plastic is placed between the seaweed and the rice so the seaweed doesn't get soggy by the time you buy the onigiri and stays nice and crispy (and it works!)."
    },
    {
      "tag":"images",
      "id":"etc-pic",
      "class":"",
      "style":{},
      "content":[
        {
          "src":"/assets/images/20190617-onigiri.jpeg",
          "style":{
            "height":"40vh",
            "minWidth":"100%"
          },
          "english":"Onigiri",
          "japanese":"おにぎり"
        },
        {
          "src":"/assets/images/20190617-dotonbori.jpeg",
          "style":{
            "height":"70vh",
            "minWidth":"100%"
          },
          "english":"Dotonbori",
          "japanese":"道頓堀"
        },
        {
          "src":"/assets/images/20190617-ebisubashisuji.jpeg",
          "style":{
            "height":"70vh",
            "minWidth":"100%"
          },
          "english":"Ebisubashisuji",
          "japanese":"戎橋筋"
        }
      ]
    }
  ]
}
