{
  "location":"Hiroshima",
  "date":"20190619",
  "id":"20190619",
  "place":"Hiroshima",
  "imgsrc":"/assets/images/20190619-childrenspeacemonument.jpeg",
  "english":"Hiroshima",
  "japanese":"広島",
  "content":[
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"My third day of the trip began with me waking up at about 4:30 am and not being able to fall back asleep, so as I write this I've been up nearly 20 hours.. again. Looking back I probably should've just taken it easy instead of going to Hiroshima today. However, without said hindsight I hopped on the Shinkansen and took the hour and a half ride down to Hiroshima. About ten minutes in a guy came to me and told me I was in the wrong seat, and I was, so I had to walk to the right one. I read my ticket wrong and boarded car 15 instead of car 5! Walking to my seat I had to pass by a group of high school students on a field trip and I was stared at, by everyone. That was a bit awkward. Anyhow, I eventually made it to my seat, sat down, and got to see some Japanese farm land fly by as I made my way to Hiroshima."
    },
    {
      "tag":"images",
      "id":"20190619pics1",
      "class":"",
      "style":{},
      "content":[
        {
          "src":"/assets/images/20190619-shinkansen.jpeg",
          "style":{
            "height":"50vh",
            "minWidth":"100%"
          },
          "english":"Shinkansen",
          "japanese":"新幹線"
        }
      ]
    },
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"Once in Hiroshima, I made my way to my first destination: Okonomimura. It's a place that's 3 floors of Okonomiyaki stall after Okonomiyaki stall, and each one has something unique. Okonomiyaki just means like \"grilled to your liking\", and people call it Japan's pizza. There's Hiroshima style Okonomiyaki and Osaka style Okonomiyaki, and they are quite different from each other. At Okonomimura, the place I went to was called 八昌 (Hasshou) and its specialty is that it's run by mostly two elderly ladies! The food was pretty good, and I had fun there because it's really not somewhere a lot of foreigners go, so the staff were happy to use Japanese with me, and the people next to me even said Kanpai with me when I got my beer and asked me some stuff like where I came from and where I got good at Japanese. I told them about where I was going after eating, and the guy to my right was saying how he thinks it's good that an American is going to see the Atomic Bomb Memorial."
    },
    {
      "tag":"images",
      "id":"20190619pics2",
      "class":"",
      "style":{},
      "content":[
        {
          "src":"/assets/images/20190619-okonomimuramap.jpeg",
          "style":{
            "height":"75vh",
            "minWidth":"100%"
          },
          "english":"Okonomimura Information",
          "japanese":"お好み村の案内表示　ぶちうまいけぇ"
        },
        {
          "src":"/assets/images/20190619-okonomiyakigrill.jpeg",
          "style":{
            "height":"75vh",
            "minWidth":"100%"
          },
          "english":"Making Okonomiyaki",
          "japanese":"お好み焼きを作ってくれている"
        },
        {
          "src":"/assets/images/20190619-okonomiyaki.jpeg",
          "style":{
            "height":"75vh",
            "minWidth":"100%"
          },
          "english":"Okonomiyaki",
          "japanese":"お好み焼き"
        }
      ]
    },
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"It was just a short walk from Okonomimura to the Atomic Bomb Memorial. After arriving there, I just kinda wandered around and took pictures of things. I read some of the plaques, but, honestly, after reading just a couple you get the gist of what they are all going to say so I just decided to focus on what was around me instead. If you want a piece of history, I recommend looking up Sasaki Sadako. She's a girl who died due to poisoning from the bomb, and she's responsible for making the paper crane a symbol of peace and a symbol for one's hope that a friend or family member will get over their sicknesses. She tried to fold a thousand paper cranes so that her sickness would go away, but wasn't able to before passing, and now her wish lives on through this culutural tradition in Japan (this is all stuff we learned in my Japanese language classes!)."
    },
    {
      "tag":"images",
      "id":"20190619pics3",
      "class":"",
      "style":{},
      "content":[
        {
          "src":"/assets/images/20190619-genbakudome.jpeg",
          "style":{
            "height":"85vh",
            "minWidth":"100%"
          },
          "english":"Atomic Bomb Dome",
          "japanese":"原爆ドーム"
        },
        {
          "src":"/assets/images/20190619-childrenspeacemonument.jpeg",
          "style":{
            "height":"85vh",
            "minWidth":"100%"
          },
          "english":"Children's Peace Monument",
          "japanese":"子供の平和モニュメント"
        },
        {
          "src":"/assets/images/20190619-cenotaph.jpeg",
          "style":{
            "height":"85vh",
            "minWidth":"100%"
          },
          "english":"Memorial Cenotaph",
          "japanese":"原爆死没者慰霊碑"
        }
      ]
    },
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"It was interesting seeing the school kids holding a ceremony at the Children's monument. They were shouting things like \"We will not wage war!\" and singing songs (I still can't understand Japanese when it's in music). I guess it was kind of appropriate timing for me to show up! There were many many schools hosting their field trips here. Another funny encounter, when I was walking around the Atomic Bomb Dome, there was this random middle aged Japanese guy that stopped me randomly, and asked in broken English where I'm from, and when I said America, he immediately started telling me, in broken English, that he knows everything about America and like started quizzing me on what states cities are in and other random facts. I think he was a little bit crazy, and it must've been interesting for the school kids to see some American speaking Japanese to this Japanese guy that's talking very loudly in broken English about random American stuff. He ended the conversation by saying, in English, that my Japanese is very good, and then saying that my very white skin is pretty (Japanese people like White skin, and have for a long time as you would notice through their use of white makeup). He later showed up, once again, and talked to me about how he has a friend in Yokohama who dresses up like a cockroach, and has a cockroach car, and started quizzing me again, then finally left me alone. But honestly, that guy might've been the highlight of my day."
    },
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"After visiting the memorial I intended to go to Miyajima, but I didn't realize how much walking around in high humidity would burn me out, so I just found a shop to sit in for a while before heading back to Hiroshima station. I bought a few more manga and novels to add to my collection of summer reading, and took my train back to Osaka. I got back pretty late and was tired, so I visited a 7-11 and got some onigiri and really tasty instant ramen. These things are like 10x more advanced than the ones in America, and about as many times as delicious!"
    },
    {
      "tag":"images",
      "id":"20190619pics4",
      "class":"",
      "style":{},
      "content":[
        {
          "src":"/assets/images/20190619-ramenpackets.jpeg",
          "style":{
            "height":"50vh"
          },
          "english":"Instant Ramen Stuff",
          "japanese":"インスタントラーメン"
        },
        {
          "src":"/assets/images/20190619-ramen.jpeg",
          "style":{
            "height":"50vh"
          },
          "english":"Finished Instant Ramen",
          "japanese":"出来上がったインスタントラーメン"
        }
      ]
    }
  ]
}
