{
  "location":"Asakusa",
  "date":"20190630",
  "id":"20190630",
  "place":"Asakusa",
  "imgsrc":"/assets/images/20190630-dino1.jpeg",
  "english":"Asakusa",
  "japanese":"浅草",
  "content":[
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"Today was the last full day of my trip, and as a sort of final hurrah I went over to Ueno to go to the National Museum of Nature and Science. The museum is one of many in the gigantic Ueno park, and it's probably one of the lesser famous one, mostly popular because it keeps kids more entertained than the cultural museums or the modern art museums. I paid the $6 entrance fee then just walked around it for a bit, testing my Kanji comprehension skills on plaques written only in Japanese with words I've never seen. Luckily since they were all familiar subjects of things taught in school and at every other natural history museum (like the various mass extinctions and the cambrian explosion and stuff like that), I was able to piece together what a lot of words meant, but I've probably forgotten them all. At least they had how to read the word written in furigana on top of every kanji (so the kids and I guess foreigners like me can read the kanji they've never seen before). The museum was pretty cool, but I was a bit underwhelmed because it was pretty similar to the stuff that I've seen in SF. I guess that's my fault for reading reviews only in Japanese because I suppose it's one of few museums of its kind in Japan. The coolest part were the dinosaurs. I also picked up a cute bookmark from the gift shop to go with all my books I bought on this trip."
    },
    {
      "tag":"images",
      "id":"20190630pics1",
      "class":"",
      "style":{},
      "content":[
        {
          "src":"/assets/images/20190630-dino1.jpeg",
          "style":{
            "height":"90vh",
            "minWidth":"100%"
          },
          "english":"Dinousars",
          "japanese":"恐竜"
        },
        {
          "src":"/assets/images/20190630-dino2.jpeg",
          "style":{
            "height":"90vh",
            "minWidth":"100%"
          },
          "english":"Dinousars",
          "japanese":"恐竜"
        },
        {
          "src":"/assets/images/20190630-cat.jpeg",
          "style":{
            "height":"90vh",
            "minWidth":"100%"
          },
          "english":"Cat Thing",
          "japanese":"猫みたいな生物"
        }
      ]
    },
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"After walking outside I saw a dance circle thing going on. Looks like people could just walk in and join if they wanted to. I don't really know what was going on, but seemed interesting, but I just walked straight by because I was hungry and wanted food."
    },
    {
      "tag":"images",
      "id":"20190630pics2",
      "class":"",
      "style":{},
      "content":[
        {
          "src":"/assets/images/20190630-dance.jpeg",
          "style":{
            "height":"90vh",
            "minWidth":"100%"
          },
          "english":"Dance",
          "japanese":"踊り"
        }
      ]
    },
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"After exiting the park I realized that I was pretty close, by subway, to the super famous temple Sensoji and its accompanied shopping street in Asakusa. I saw the temple before five years ago, and it's so full of people you can't get a really good picture of it, so I don't really have anything of it, but I did take pictures of all the street food I grabbed from nearby stalls. I hadn't had lunch so I spent a good hour or two walking the side streets around it. I went into a chopstick store with a cute clerk trying to speak English with all the foreigners and acted all surprised when I could speak Japanese and was impressed by my abilities to pick up beans and other random round objects from their testing trays for said chopsticks. I bought a pair last time I came to Japan but they broke after a couple years of use, so I figured I'd grab another pair here. She explained that the tips of some of them are roughed up to make it easier to grab noodles with, which was something I had noticed but hadn't known why. I got a pair with a blue painted top that has a sakura on it. I didn't get my name engraved this time around, I liked how they looked without any tampering on them. Walking around I also caught a glimpse of the skytree tower. I went up it my last time to Japan and the weather was like it is now, so you couldn't see anything from the observation deck."
    },
    {
      "tag":"images",
      "id":"20190630pics3",
      "class":"",
      "style":{},
      "content":[
        {
          "src":"/assets/images/20190630-manju.jpeg",
          "style":{
            "height":"90vh",
            "minWidth":"100%"
          },
          "english":"Fried Manju (Front: Curry, Back: Custard)",
          "japanese":"揚げたまんじゅう（前：カレー　後ろ：カスタード）"
        },
        {
          "src":"/assets/images/20190630-karage.jpeg",
          "style":{
            "height":"90vh",
            "minWidth":"100%"
          },
          "english":"Giant Karage",
          "japanese":"すごく大きい唐揚げ"
        },
        {
          "src":"/assets/images/20190630-taiyaki.jpeg",
          "style":{
            "height":"90vh",
            "minWidth":"100%"
          },
          "english":"Taiyaki",
          "japanese":"たい焼き"
        },
        {
          "src":"/assets/images/20190630-street.jpeg",
          "style":{
            "height":"90vh",
            "minWidth":"100%"
          },
          "english":"Stalls",
          "japanese":"屋台"
        },
        {
          "src":"/assets/images/20190630-Sensoji.jpeg",
          "style":{
            "height":"90vh",
            "minWidth":"100%"
          },
          "english":"Sensoji",
          "japanese":"浅草寺"
        },
        {
          "src":"/assets/images/20190630-skytree.jpeg",
          "style":{
            "height":"90vh",
            "minWidth":"100%"
          },
          "english":"Skytree",
          "japanese":"スカイツリー"
        }
      ]
    },
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"After eating and shopping I took the 30 minute subway ride (was lucky in that I went from the last stop on one end to the last stop on the other end so I didn't have to transfer trains at all or worry about missing my stop while reading my book) and went back to Shibuya. I watched some youtube videos for an hour or so in my room, then decided it was time for dinner and wanted to right my wrong from yesterday and got some actual tsukemen. This was better than that first place I went to a few days back in my opinion, and it's a chain restaurant as well. It would appear that ramen chains are just really good in Japan as they are really popular and always have reviews on yelp and stuff that rival those of local shops. I'm not really sure what the soup was for this tsukemen, probably still tonkotsu, but it was a bit different from the regular tonkotsu broth you get."
    },
    {
      "tag":"images",
      "id":"20190629pics1",
      "class":"",
      "style":{},
      "content":[
        {
          "src":"/assets/images/20190630-tsukemen.jpeg",
          "style":{
            "height":"90vh",
            "minWidth":"100%"
          },
          "english":"Tsukemen",
          "japanese":"つけ麺"
        }
      ]
    },
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"Now that I'm back at my hotel, going to take a nice shower, pack up my bags, and get ready to head to the airport tomorrow. It takes a while to get there, and getting on planes and stuff makes me anxious, so I intend to leave Shibuya at around 11 AM, even though my flight is at 5pm. The train ride takes about an hour if I remember right, and when I get at the airport, I'll just enjoy some conbini food one last time. I'll really miss those things in America. I think it's just that America's cities are too spread out so having a store with high convenience doesn't really make sense, but I wish they existed in America. They're really truly great."
    }
  ]
}
