{
  "location":"Shibuya",
  "date":"20190629",
  "id":"20190629",
  "place":"Shibuya",
  "imgsrc":"/assets/images/20190629-yuri.jpeg",
  "english":"Shibuya",
  "japanese":"渋谷",
  "content":[
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"Combining entries again because I haven't done much and I'm tired."
    },
    {
      "tag":"bold",
      "id":"",
      "class":"",
      "style":{},
      "content":{
        "english":"June 28th",
        "japanese":"六月二十八日"
      }
    },
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"Today I spent the morning just chilling in my hotel chatting with friends online before heading out to Shibuya. My last hotel is right near Shibuya station. I think this is the part of the trip I thought through the least. I kinda just booked a hotel in Shibuya because I've been here before and I thought \"Oh it's a shopping spot so I'll just buy some clothes or other things here!\" but I don't have the nerve to shop in person alone in America, so I definitely don't have the nerve here. I did look into some windows and just at all the trendy young people around, and I do like the current Japanese styles a bit more than America's. The crowds here are a bit overwhelming, and I think I would enjoy shopping more in Yokohama where things just felt more manageable. After wandering that massive scramble crossing a few times, I went to a favorite ramen place, the exact same branch I came with my teacher 5 years ago, and had Ichiran ramen for the second time on this trip. After eating I just wandered for a bit, went to Tokyu hands which is a popular random goods store and found a couple random stickers, but otherwise came out empty handed. I just don't like buying random stuff that much. Once done shopping just went back to my hotel where I played some games with Japanese friends for a couple hours then went to sleep."
    },
    {
      "tag":"images",
      "id":"20190628pics1",
      "class":"",
      "style":{},
      "content":[
        {
          "src":"/assets/images/20190628-ichiranbooth.jpeg",
          "style":{
            "height":"90vh",
            "minWidth":"100%"
          },
          "english":"Ichiran Booth",
          "japanese":"一蘭の席"
        },
        {
          "src":"/assets/images/20190628-ramen.jpeg",
          "style":{
            "height":"90vh",
            "minWidth":"100%"
          },
          "english":"Ramen",
          "japanese":"ラーメン・ネギ追加"
        }
      ]
    },
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"Shibuya has a very great night life, something I'm also not comfortable exploring alone. Perhaps I would like this part of the trip much more with a friend..."
    },
    {
      "tag":"bold",
      "id":"",
      "class":"",
      "style":{},
      "content":{
        "english":"June 29th",
        "japanese":"六月二十九日"
      }
    },
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"After getting myself out of my hotel room, I went and ate conveyor belt sushi for the 3rd time on this trip. I think this place was probably the best one I've been to so far. It was on the top floor of a department store, and I had to wait about 30 mins to get in. I was in line sandwiched between a younger couple with their child and a more elderly couple, and the baby kept making faces towards us. Anyhow, this sushi place, as I said, was probably the best of the three I've been to so far, but was smack dab in the middle in terms of price. I ate something like 9 servings of fish, and it racked up to only $19 bucks. The first place I ate about the same amount but it was twice as much (I believe around $35 bucks), and the previous place I got 6 plates for $9. So I would say this one was the best deal and worth the wait. I didn't get pics of everything I ate, because some were things I've posted before and I was also too hungry to think and just started eating as soon as I got it. With conveyor belt sushi places you can always order stuff off of menus as well, so I ate just a couple things from the conveyor as I waited between orders of food coming in. I think that's probably the best way to do it. They don't put the best stuff on the belt so you gotta make sure to order it."
    },
    {
      "tag":"images",
      "id":"20190629pics1",
      "class":"",
      "style":{},
      "content":[
        {
          "src":"/assets/images/20190629-sushi.jpeg",
          "style":{
            "height":"90vh",
            "minWidth":"100%"
          },
          "english":"Conveyor Belt Sushi",
          "japanese":"回転寿司"
        },
        {
          "src":"/assets/images/20190629-sushi1.jpeg",
          "style":{
          },
          "english":"Minced Tuna Gunkanmaki",
          "japanese":"マグロ軍艦巻き"
        },
        {
          "src":"/assets/images/20190629-sushi2.jpeg",
          "style":{
          },
          "english":"Hirame - Flounder",
          "japanese":"平目"
        },
        {
          "src":"/assets/images/20190629-sushi3.jpeg",
          "style":{
          },
          "english":"Marinated Tuna",
          "japanese":"漬けマグロ"
        },
        {
          "src":"/assets/images/20190629-sushi4.jpeg",
          "style":{
          },
          "english":"Sea Bream",
          "japanese":"鯛"
        },
        {
          "src":"/assets/images/20190629-sushi5.jpeg",
          "style":{
          },
          "english":"Unagi!",
          "japanese":"うなぎ！"
        }
      ]
    },
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"Once I ate I just walked around a bit, and went to various stores and looked at random things. They have this massive chain of sells everything and anything kind of store called Don Quijote, and I went in and just walked around and it was bizarre as it's just shelves crammed with anything you can think of. Alcohol, detergent, candy, handheld electronics, etc etc. After that I went to several otaku oriented stores hoping to find some random merchandise with my favorite characters on it, but it was to no avail. I read the intro to some random manga on a shelf in the yuri section and took a picture of the title of one that I want to buy the first book for when I get home to see if I like it, and that's the only picture I have from the entire experience so I'll put it here (I'll try to translate the title but this stuff is hard). After searching the Shibuya shops for said merchandise and coming up empty handed, I decided to look at the branches of the same stores in Ikebukuro, and hopped on the subway there, went to the stores, and was disappointed yet again when they didn't have anything. They really only sell goods for the super major series like My Hero Academia, One Piece, Sword Art Online, or the currently airing popular anime. Every store had like a gigantic section for this one romance show that aired last season, and even though I thought it was dumb, I guess it's wildly popular here. Needless to say, I'm a little let down  because the only little thing I was able to buy was a keychain I got in Akihabara a few days ago, and even though I spent a few hours going to various branches of these stores, I didn't spot a single thing with my favorite characters on it today."
    },
    {
      "tag":"images",
      "id":"20190629pics2",
      "class":"",
      "style":{},
      "content":[
        {
          "src":"/assets/images/20190629-yuri.jpeg",
          "style":{
            "height":"90vh",
            "minWidth":"100%"
          },
          "english":"Cover Page of \"Singing of Love in a Whisper\"",
          "japanese":"「ささやくように恋を唄う」の表紙"
        }
      ]
    },
    {
      "tag":"p",
      "id":"",
      "class":"",
      "style":{},
      "content":"After feeling let down, I went back to Shibuya and felt like eating more tsukemen, so I looked up a store and walked in it's direction. I found a place that looked like the one I googled, walked in, went to the ticket machine and realized it was not the same store, and that they only served regular ramen here. I felt too embarrassed to back down, so I just bought a ticket for their specialty ramen, sat down and ate. It was pretty good, yet another tonkotsu ramen, not the best I've had on the trip, but still better than any US ramen I've had. Since coming here I've really noticed that Tonkotsu is the popular choice for ramen stock, as nearly every where you go sells tonkotsu ramen only instead of like broths made with chicken stock. I think the tsukemen I had is the only ramen that wasn't purely tonkotsu as it had chicken in its stock as well. Something interesting was that they gave noodle refills for free here, so I took advantage of that and grabbed a refill before finishing off the toppings and just leaving. Nice thing about the ticket system with ramen places is you just buy your tickets, sit down, hand them to the staff, get your food, eat, and leave without worry of paying the bill and there's no tipping in Japan either. It makes it quick and easy. After eating I went back to my hotel and I intend to now just read my book for a couple hours before sleeping."
    },
    {
      "tag":"images",
      "id":"20190629pics3",
      "class":"",
      "style":{},
      "content":[
        {
          "src":"/assets/images/20190629-ramen.jpeg",
          "style":{
            "height":"90vh",
            "minWidth":"100%"
          },
          "english":"Ramen",
          "japanese":"ラーメン"
        }
      ]
    }
  ]
}
